{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 32, 32], "input_dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "maxpooling2d_10"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_8"}, "inbound_nodes": [[["maxpooling2d_10", 0, 0]]], "name": "dropout_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_8", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_12", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "maxpooling2d_12"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_11", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["dropout_8", 0, 0]]], "name": "maxpooling2d_11"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_9"}, "inbound_nodes": [[["maxpooling2d_12", 0, 0]]], "name": "dropout_9"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}, "inbound_nodes": [[["maxpooling2d_11", 0, 0]]], "name": "flatten_6"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}, "inbound_nodes": [[["dropout_9", 0, 0]]], "name": "flatten_7"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["flatten_6", 0, 0], ["flatten_7", 0, 0]]], "name": "merge_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 256}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "dropout_10"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 43}, "inbound_nodes": [[["dropout_10", 0, 0]]], "name": "dense_6"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_3"}}